Repository: securesauce/precli
Catalog: precli/locale/*/LC_MESSAGES/messages.po
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_cn, zh_tw

source: Weak ciphers like '{0}' should be avoided due to their known vulnerabilities and weaknesses.
de: Schwache Chiffren wie '{0}' sollten aufgrund ihrer bekannten Schwachstellen und Sicherheitsrisiken vermieden werden.
es: Se deben evitar cifrados débiles como '{0}' debido a sus vulnerabilidades y debilidades conocidas.
fr: Les chiffrements faibles comme '{0}' doivent être évités en raison de leurs vulnérabilités et faiblesses connues.
it: I cifrari deboli come '{0}' devono essere evitati a causa delle loro vulnerabilità e debolezze note.
ja: 既知の脆弱性や弱点があるため、'{0}' のような弱い暗号は避けるべきです。
ko: '{0}'와 같은 약한 암호화 알고리즘은 알려진 취약점과 약점 때문에 사용을 피해야 합니다.
pt_br: Cifras fracas como '{0}' devem ser evitadas devido às suas vulnerabilidades e fraquezas conhecidas.
ru: Слабые шифры, такие как '{0}', следует избегать из-за известных уязвимостей и недостатков.
zh_cn: 应避免使用类似 '{0}' 的弱加密算法，因为它们存在已知的漏洞和缺陷。
zh_tw: 應避免使用類似 '{0}' 的弱加密演算法，因為它們存在已知的漏洞與弱點。

source: It is advisable to use a stronger, more secure cryptographic algorithm like AES.
de: Es wird empfohlen, einen stärkeren und sichereren Verschlüsselungsalgorithmus wie AES zu verwenden.
es: Se recomienda utilizar un algoritmo criptográfico más fuerte y seguro, como AES.
fr: Il est conseillé d'utiliser un algorithme cryptographique plus fort et plus sécurisé, comme AES.
it: Si consiglia di utilizzare un algoritmo crittografico più forte e sicuro, come AES.
ja: AES のようなより強力で安全な暗号アルゴリズムを使用することを推奨します。
ko: 더 강력하고 안전한 AES와 같은 암호화 알고리즘을 사용하는 것이 좋습니다.
pt_br: É recomendável usar um algoritmo criptográfico mais forte e seguro, como o AES.
ru: Рекомендуется использовать более надежный и безопасный криптографический алгоритм, например AES.
zh_cn: 建议使用更强大、更安全的加密算法，如 AES。
zh_tw: 建議使用更強大、更安全的加密演算法，例如 AES。

source: Using '{0}' key sizes less than '{1}' bits is considered vulnerable to attacks.
de: Die Verwendung von '{0}' mit einer Schlüssellänge unter '{1}' Bits gilt als anfällig für Angriffe.
es: El uso de claves '{0}' con tamaños menores a '{1}' bits se considera vulnerable a ataques.
fr: L'utilisation de tailles de clé '{0}' inférieures à '{1}' bits est considérée comme vulnérable aux attaques.
it: L'uso di chiavi '{0}' con dimensioni inferiori a '{1}' bit è considerato vulnerabile agli attacchi.
ja: '{0}' の鍵サイズが '{1}' ビット未満の場合、攻撃に対して脆弱と見なされます。
ko: '{0}' 키 크기가 '{1}' 비트보다 작으면 공격에 취약한 것으로 간주됩니다.
pt_br: O uso de tamanhos de chave '{0}' menores que '{1}' bits é considerado vulnerável a ataques.
ru: Использование ключей '{0}' размером менее '{1}' бит считается уязвимым для атак.
zh_cn: 使用 '{0}' 密钥长度小于 '{1}' 位的情况被认为容易受到攻击。
zh_tw: 使用 '{0}' 的密鑰長度小於 '{1}' 位元被認為容易受到攻擊。

source: DSA keys.
de: DSA-Schlüssel.
es: Claves DSA.
fr: Clés DSA.
it: Chiavi DSA.
ja: DSAキー。
ko: DSA 키.
pt_br: Chaves DSA.
ru: Ключи DSA.
zh_cn: DSA 密钥。
zh_tw: DSA 密鑰。

source: RSA keys.
de: RSA-Schlüssel.
es: Claves RSA.
fr: Clés RSA.
it: Chiavi RSA.
ja: RSAキー。
ko: RSA 키.
pt_br: Chaves RSA.
ru: Ключи RSA.
zh_cn: RSA 密钥。
zh_tw: RSA 密鑰。

source: The function '{0}(0)' escalates the process to run with root (superuser) privileges.
de: Die Funktion '{0}(0)' eskaliert den Prozess, um mit Root- (Superuser-) Rechten ausgeführt zu werden.
es: La función '{0}(0)' escala el proceso para ejecutarse con privilegios de root (superusuario).
fr: La fonction '{0}(0)' élève les privilèges du processus pour s'exécuter en tant que root (superutilisateur).
it: La funzione '{0}(0)' eleva il processo per essere eseguito con privilegi di root (superutente).
ja: 関数 '{0}(0)' はプロセスを root (スーパーユーザー) 権限で実行するように昇格させます。
ko: 함수 '{0}(0)'는 프로세스를 루트(최고 권한)로 실행하도록 상승시킵니다.
pt_br: A função '{0}(0)' eleva o processo para ser executado com privilégios de root (superusuário).
ru: Функция '{0}(0)' повышает привилегии процесса до root (суперпользователь).
zh_cn: 函数 '{0}(0)' 将进程提升为 root（超级用户）权限。
zh_tw: 函式 '{0}(0)' 會將程序提升為 root（超級使用者）權限。

source: Use of weak hash function '{0}' does not meet security expectations.
de: Die Verwendung der schwachen Hash-Funktion '{0}' entspricht nicht den Sicherheitsanforderungen.
es: El uso de la función hash débil '{0}' no cumple con las expectativas de seguridad.
fr: L'utilisation de la fonction de hachage faible '{0}' ne répond pas aux attentes en matière de sécurité.
it: L'uso della funzione hash debole '{0}' non soddisfa le aspettative di sicurezza.
ja: 弱いハッシュ関数 '{0}' の使用は、セキュリティ要件を満たしていません。
ko: 약한 해시 함수 '{0}'의 사용은 보안 요구 사항을 충족하지 않습니다.
pt_br: O uso da função de hash fraca '{0}' não atende às expectativas de segurança.
ru: Использование слабой хеш-функции '{0}' не соответствует требованиям безопасности.
zh_cn: 使用弱哈希函数 '{0}' 不符合安全要求。
zh_tw: 使用弱哈希函式 '{0}' 無法滿足安全要求。

source: Use a more secure hashing algorithm like sha256.
de: Verwenden Sie einen sichereren Hash-Algorithmus wie SHA-256.
es: Utilice un algoritmo de hash más seguro, como SHA-256.
fr: Utilisez un algorithme de hachage plus sécurisé, comme SHA-256.
it: Utilizzare un algoritmo di hashing più sicuro, come SHA-256.
ja: より安全なハッシュアルゴリズム（例：sha256）を使用してください。
ko: SHA-256과 같은 더 안전한 해싱 알고리즘을 사용하세요.
pt_br: Use um algoritmo de hash mais seguro, como SHA-256.
ru: Используйте более безопасный алгоритм хеширования, например SHA-256.
zh_cn: 请使用更安全的哈希算法，例如 SHA-256。
zh_tw: 請使用更安全的哈希演算法，例如 SHA-256。

source: The class '{0}' is used without a timeout, which may cause the application to block indefinitely if the remote server does not respond.
de: Die Klasse '{0}' wird ohne Timeout verwendet, was dazu führen kann, dass die Anwendung unendlich blockiert wird, wenn der entfernte Server nicht antwortet.
es: La clase '{0}' se usa sin un tiempo de espera, lo que puede hacer que la aplicación se bloquee indefinidamente si el servidor remoto no responde.
fr: La classe '{0}' est utilisée sans délai d'expiration, ce qui peut entraîner un blocage indéfini de l'application si le serveur distant ne répond pas.
it: La classe '{0}' viene utilizzata senza un timeout, il che potrebbe causare il blocco indefinito dell'applicazione se il server remoto non risponde.
ja: クラス '{0}' はタイムアウトなしで使用されています。リモートサーバーが応答しない場合、アプリケーションが無期限にブロックされる可能性があります。
ko: '{0}' 클래스가 타임아웃 없이 사용되었으며, 원격 서버가 응답하지 않으면 애플리케이션이 무기한 멈출 수 있습니다.
pt_br: A classe '{0}' está sendo usada sem um tempo limite, o que pode fazer com que a aplicação fique bloqueada indefinidamente caso o servidor remoto não responda.
ru: Класс '{0}' используется без тайм-аута, что может привести к бесконечной блокировке приложения, если удаленный сервер не отвечает.
zh_cn: 类 '{0}' 在使用时未设置超时，如果远程服务器无响应，应用程序可能会无限期阻塞。
zh_tw: 類別 '{0}' 在使用時未設置超時，若遠端伺服器無回應，應用程式可能會無限期卡住。

source: Set timeout parameter to a small number of seconds.
de: Setzen Sie den Timeout-Parameter auf eine geringe Anzahl von Sekunden.
es: Establezca el parámetro de tiempo de espera en un número pequeño de segundos.
fr: Définissez le paramètre de délai d'expiration sur un faible nombre de secondes.
it: Impostare il parametro di timeout a un numero basso di secondi.
ja: タイムアウトパラメータを数秒程度の小さな値に設定してください。
ko: 타임아웃 매개변수를 몇 초 정도로 설정하세요.
pt_br: Defina o parâmetro de tempo limite para um pequeno número de segundos.
ru: Установите параметр тайм-аута в несколько секунд.
zh_cn: 请将超时参数设置为几秒钟。
zh_tw: 請將超時參數設為幾秒鐘內的數值。

source: The hash function '{0}' is vulnerable to collision and pre-image attacks.
de: Die Hash-Funktion '{0}' ist anfällig für Kollisionen und Vorbildangriffe.
es: La función hash '{0}' es vulnerable a ataques de colisión y preimagen.
fr: La fonction de hachage '{0}' est vulnérable aux attaques par collision et préimage.
it: La funzione hash '{0}' è vulnerabile agli attacchi di collisione e pre-immagine.
ja: ハッシュ関数 '{0}' は、衝突攻撃やプレイメージ攻撃に対して脆弱です。
ko: 해시 함수 '{0}'는 충돌 및 선이미지(pre-image) 공격에 취약합니다.
pt_br: A função de hash '{0}' é vulnerável a ataques de colisão e pré-imagem.
ru: Хеш-функция '{0}' уязвима для атак коллизий и предобразов.
zh_cn: 哈希函数 '{0}' 容易受到碰撞攻击和原像攻击。
zh_tw: 哈希函式 '{0}' 容易受到碰撞攻擊和前映像攻擊的影響。

source: For cryptographic purposes, use a hash length of at least 256-bits with hashes such as SHA-256.
de: Für kryptografische Zwecke sollte eine Hash-Länge von mindestens 256 Bit verwendet werden, z. B. mit SHA-256.
es: Para fines criptográficos, utilice una longitud de hash de al menos 256 bits con hashes como SHA-256.
fr: Pour des raisons cryptographiques, utilisez une longueur de hachage d'au moins 256 bits avec des algorithmes comme SHA-256.
it: Per scopi crittografici, utilizzare una lunghezza di hash di almeno 256 bit con funzioni di hash come SHA-256.
ja: 暗号目的では、SHA-256 などの 256 ビット以上のハッシュを使用してください。
ko: 암호화 목적으로는 SHA-256과 같은 최소 256비트 길이의 해시를 사용하세요.
pt_br: Para fins criptográficos, use um comprimento de hash de pelo menos 256 bits com algoritmos como SHA-256.
ru: Для криптографических целей используйте длину хеша не менее 256 бит, например SHA-256.
zh_cn: 出于加密目的，应使用至少 256 位的哈希值，如 SHA-256。
zh_tw: 出於加密目的，請使用至少 256 位元的哈希值，如 SHA-256。

source: Potential unsafe usage of '{0}' that can allow instantiation of arbitrary objects.
de: Mögliche unsichere Verwendung von '{0}', die die Instanziierung beliebiger Objekte ermöglichen kann.
es: Uso potencialmente inseguro de '{0}', lo que puede permitir la instanciación de objetos arbitrarios.
fr: Utilisation potentiellement dangereuse de '{0}', pouvant permettre l'instanciation d'objets arbitraires.
it: Uso potenzialmente non sicuro di '{0}', che potrebbe consentire l'instanziazione di oggetti arbitrari.
ja: '{0}' の使用は安全でない可能性があり、任意のオブジェクトをインスタンス化する可能性があります。
ko: '{0}'의 사용이 잠재적으로 안전하지 않으며 임의의 객체를 인스턴스화할 수 있습니다.
pt_br: Uso potencialmente inseguro de '{0}', que pode permitir a instanciação de objetos arbitrários.
ru: Потенциально небезопасное использование '{0}', которое может привести к созданию произвольных объектов.
zh_cn: 可能存在不安全的 '{0}' 用法，可能允许实例化任意对象。
zh_tw: 可能存在不安全的 '{0}' 用法，可能允許實例化任意物件。

source: The POP protocol can transmit data in cleartext without encryption.
de: Das POP-Protokoll kann Daten unverschlüsselt im Klartext übertragen.
es: El protocolo POP puede transmitir datos en texto claro sin cifrado.
fr: Le protocole POP peut transmettre des données en clair sans chiffrement.
it: Il protocollo POP può trasmettere dati in chiaro senza crittografia.
ja: POPプロトコルは、データを暗号化なしでクリアテキストで送信する可能性があります。
ko: POP 프로토콜은 암호화 없이 데이터를 평문으로 전송할 수 있습니다.
pt_br: O protocolo POP pode transmitir dados em texto claro sem criptografia.
ru: Протокол POP может передавать данные в открытом виде без шифрования.
zh_cn: POP 协议可能会以明文方式传输数据，未加密。
zh_tw: POP 通訊協定可能以明文傳輸數據，未進行加密。

source: Use the 'SMTP_SSL' module to secure the connection.
de: Verwenden Sie das Modul 'SMTP_SSL', um die Verbindung zu sichern.
es: Utilice el módulo 'SMTP_SSL' para asegurar la conexión.
fr: Utilisez le module 'SMTP_SSL' pour sécuriser la connexion.
it: Utilizzare il modulo 'SMTP_SSL' per proteggere la connessione.
ja: 'SMTP_SSL' モジュールを使用して接続を保護してください。
ko: 'SMTP_SSL' 모듈을 사용하여 연결을 보호하세요.
pt_br: Use o módulo 'SMTP_SSL' para proteger a conexão.
ru: Используйте модуль 'SMTP_SSL' для защиты соединения.
zh_cn: 请使用 'SMTP_SSL' 模块来保护连接。
zh_tw: 請使用 'SMTP_SSL' 模組來保護連線。

source: transmit authentication information such as a user, password in cleartext.
de: Authentifizierungsinformationen wie Benutzername und Passwort werden im Klartext übertragen.
es: Transmite información de autenticación, como usuario y contraseña, en texto claro.
fr: transmet des informations d'authentification, telles qu'un nom d'utilisateur et un mot de passe, en clair.
it: trasmette informazioni di autenticazione, come nome utente e password, in chiaro.
ja: ユーザー名やパスワードなどの認証情報がクリアテキストで送信されます。
ko: 사용자, 비밀번호 등의 인증 정보를 평문으로 전송합니다.
pt_br: transmite informações de autenticação, como usuário e senha, em texto claro.
ru: передает учетные данные, такие как имя пользователя и пароль, в открытом виде.
zh_cn: 以明文形式传输身份验证信息，如用户名、密码。
zh_tw: 以明文形式傳輸身份驗證資訊，例如使用者名稱、密碼。

source: The function '{0}' is used without a timeout, which may cause the application to block indefinitely if the remote server does not respond.
de: Die Funktion '{0}' wird ohne Timeout verwendet, was dazu führen kann, dass die Anwendung unendlich blockiert wird, wenn der entfernte Server nicht antwortet.
es: La función '{0}' se usa sin un tiempo de espera, lo que puede hacer que la aplicación se bloquee indefinidamente si el servidor remoto no responde.
ja: 関数 '{0}' はタイムアウトなしで使用されており、リモートサーバーが応答しない場合にアプリケーションが無期限にブロックされる可能性があります。

source: The '{0}' pseudo-random generator should not be used for security purposes.
de: Der Pseudo-Zufallszahlengenerator '{0}' sollte nicht für Sicherheitszwecke verwendet werden.
es: El generador pseudoaleatorio '{0}' no debe utilizarse para fines de seguridad.
fr: Le générateur pseudo-aléatoire '{0}' ne doit pas être utilisé à des fins de sécurité.
it: Il generatore pseudo-casuale '{0}' non deve essere utilizzato per scopi di sicurezza.
ja: '{0}' 疑似乱数生成器は、セキュリティ目的には使用すべきではありません。
ko: '{0}' 의사 난수 생성기는 보안 목적으로 사용해서는 안 됩니다.
pt_br: O gerador pseudoaleatório '{0}' não deve ser usado para fins de segurança.
ru: Генератор псевдослучайных чисел '{0}' не следует использовать в целях безопасности.
zh_cn: '{0}' 伪随机数生成器不应用于安全目的。
zh_tw: '{0}' 這種偽隨機數產生器不應用於安全用途。

source: The salt should be 16 or more bytes from a proper pseudo-random source such as `os.urandom()`.
de: Das Salt sollte 16 oder mehr Bytes aus einer geeigneten Pseudo-Zufallsquelle wie `os.urandom()` enthalten.
es: El salt debe tener 16 o más bytes de una fuente pseudoaleatoria adecuada, como `os.urandom()`.
fr: Le sel doit contenir 16 octets ou plus provenant d'une source pseudo-aléatoire appropriée, comme `os.urandom()`.
it: Il sale dovrebbe essere di almeno 16 byte provenienti da una sorgente pseudo-casuale adeguata, come `os.urandom()`.
ja: ソルトは `os.urandom()` などの適切な疑似乱数ソースから 16 バイト以上にするべきです。
ko: 솔트는 `os.urandom()`과 같은 적절한 의사 난수 소스에서 최소 16바이트 이상이어야 합니다.
pt_br: O salt deve ter pelo menos 16 bytes e ser gerado por uma fonte pseudoaleatória adequada, como `os.urandom()`.
ru: Соль должна быть длиной не менее 16 байтов и генерироваться из надежного псевдослучайного источника, например `os.urandom()`.
zh_cn: 盐值应为 16 字节或更多，并来自适当的伪随机源，如 `os.urandom()`。
zh_tw: Salt 值應至少 16 位元組，並來自適當的偽隨機來源，例如 `os.urandom()`。

source: The '{0}' function does not properly validate certificates when context is unset or None.
de: Die Funktion '{0}' validiert Zertifikate nicht ordnungsgemäß, wenn der Kontext nicht gesetzt oder None ist.
es: La función '{0}' no valida correctamente los certificados cuando el contexto no está configurado o es None.
fr: La fonction '{0}' ne valide pas correctement les certificats lorsque le contexte n'est pas défini ou est None.
it: La funzione '{0}' non convalida correttamente i certificati quando il contesto non è impostato o è None.
ja: 関数 '{0}' は、コンテキストが未設定または None の場合に証明書を適切に検証しません。
ko: '{0}' 함수는 컨텍스트가 설정되지 않았거나 None일 때 인증서를 올바르게 검증하지 않습니다.
pt_br: A função '{0}' não valida corretamente os certificados quando o contexto não está definido ou é None.
ru: Функция '{0}' не выполняет корректную проверку сертификатов, если контекст не установлен или равен None.
zh_cn: 如果上下文未设置或为 None，'{0}' 函数不会正确验证证书。
zh_tw: 若未設置上下文或為 None，'{0}' 函式將無法正確驗證憑證。

source: The given key is only '{0}' bytes which is insufficient for the '{2}' algorithm.
de: Der angegebene Schlüssel ist nur '{0}' Bytes groß und damit unzureichend für den '{2}'-Algorithmus.
es: La clave proporcionada tiene solo '{0}' bytes, lo que es insuficiente para el algoritmo '{2}'.
fr: La clé fournie ne fait que '{0}' octets, ce qui est insuffisant pour l'algorithme '{2}'.
it: La chiave fornita è di soli '{0}' byte, insufficiente per l'algoritmo '{2}'.
ja: 指定された鍵は '{0}' バイトのみであり、'{2}' アルゴリズムには不十分です。
ko: 주어진 키는 '{0}' 바이트로, '{2}' 알고리즘에는 불충분합니다.
pt_br: A chave fornecida tem apenas '{0}' bytes, o que é insuficiente para o algoritmo '{2}'.
ru: Предоставленный ключ имеет длину всего '{0}' байтов, что недостаточно для алгоритма '{2}'.
zh_cn: 提供的密钥仅有 '{0}' 字节，这对于 '{2}' 算法而言不足够。
zh_tw: 提供的密鑰僅有 '{0}' 位元組，對於 '{2}' 演算法來說不足夠。

source: Use the 'POP3_SSL' module to secure the connection.
de: Verwenden Sie das Modul 'POP3_SSL', um die Verbindung zu sichern.
es: Utilice el módulo 'POP3_SSL' para asegurar la conexión.
fr: Utilisez le module 'POP3_SSL' pour sécuriser la connexion.
it: Utilizzare il modulo 'POP3_SSL' per proteggere la connessione.
ja: 'POP3_SSL' モジュールを使用して接続を保護してください。
ko: 'POP3_SSL' 모듈을 사용하여 연결을 보호하세요.
pt_br: Use o módulo 'POP3_SSL' para proteger a conexão.
ru: Используйте модуль 'POP3_SSL' для защиты соединения.
zh_cn: 请使用 'POP3_SSL' 模块来保护连接。
zh_tw: 請使用 'POP3_SSL' 模組來保護連線。

source: {0} in CLI arguments are leaked to command history, logs, ps output, etc.
de: {0} in CLI-Argumenten wird an die Befehlsverlaufshistorie, Logs, ps-Ausgabe usw. weitergegeben.
es: {0} en los argumentos de CLI se filtra en el historial de comandos, registros, salida de ps, etc.
fr: {0} dans les arguments de ligne de commande est exposé dans l'historique des commandes, les journaux, la sortie de ps, etc.
it: {0} negli argomenti della CLI viene esposto nella cronologia dei comandi, nei log, nell'output di ps, ecc.
ja: CLI 引数の {0} が、コマンド履歴、ログ、ps の出力などに漏洩する可能性があります。
ko: CLI 인수에 포함된 {0}이 명령어 기록, 로그, ps 출력 등에 노출될 수 있습니다.
pt_br: {0} nos argumentos da CLI são expostos no histórico de comandos, logs, saída do ps, etc.
ru: {0} в аргументах командной строки могут попасть в историю команд, журналы, вывод ps и т. д.
zh_cn: 命令行参数中的 {0} 可能会泄露到命令历史、日志、ps 输出等。
zh_tw: 命令列參數中的 {0} 可能會洩漏至命令歷史記錄、日誌、ps 輸出等。

source: A token size of '{0}' is less than the recommended '{1}' bytes, which can be vulnerable to brute-force attacks.
de: Eine Token-Größe von '{0}' ist kleiner als die empfohlenen '{1}' Bytes und könnte anfällig für Brute-Force-Angriffe sein.
es: Un tamaño de token de '{0}' es menor que los '{1}' bytes recomendados, lo que lo hace vulnerable a ataques de fuerza bruta.
fr: Une taille de jeton de '{0}' est inférieure aux '{1}' octets recommandés, ce qui peut être vulnérable aux attaques par force brute.
it: Una dimensione del token di '{0}' è inferiore ai '{1}' byte consigliati, rendendolo vulnerabile agli attacchi a forza bruta.
ja: トークンサイズ '{0}' は、推奨される '{1}' バイト未満であり、ブルートフォース攻撃に対して脆弱です。
ko: '{0}' 바이트 크기의 토큰은 권장 크기인 '{1}' 바이트보다 작아, 무차별 대입 공격에 취약할 수 있습니다.
pt_br: Um token de tamanho '{0}' é menor que o recomendado de '{1}' bytes, o que pode ser vulnerável a ataques de força bruta.
ru: Размер токена '{0}' меньше рекомендуемых '{1}' байтов, что делает его уязвимым для атак перебора.
zh_cn: 令牌大小 '{0}' 小于推荐的 '{1}' 字节，可能容易受到暴力破解攻击。
zh_tw: 令牌大小 '{0}' 小於推薦的 '{1}' 位元組，可能容易受到暴力破解攻擊。

source: Pass None or no parameter to use the default entropy.
de: Geben Sie None oder keinen Parameter an, um die Standard-Entropie zu verwenden.
es: Pase None o no proporcione un parámetro para usar la entropía predeterminada.
fr: Passez None ou aucun paramètre pour utiliser l'entropie par défaut.
it: Passare None o nessun parametro per utilizzare l'entropia predefinita.
ja: デフォルトのエントロピーを使用するには、None を渡すか、パラメータを指定しないでください。
ko: 기본 엔트로피를 사용하려면 None 또는 매개변수를 전달하지 마세요.
pt_br: Passe None ou nenhum parâmetro para usar a entropia padrão.
ru: Передайте None или не указывайте параметр, чтобы использовать стандартную энтропию.
zh_cn: 传递 None 或不提供参数以使用默认熵值。
zh_tw: 請傳遞 None 或不提供參數，以使用預設的熵值。

source: Binding to '{0}' exposes the application on all network interfaces, increasing the risk of unauthorized access.
de: Das Binden an '{0}' macht die Anwendung auf allen Netzwerkschnittstellen verfügbar und erhöht das Risiko eines unbefugten Zugriffs.
es: Vincularse a '{0}' expone la aplicación en todas las interfaces de red, aumentando el riesgo de acceso no autorizado.
fr: L'association à '{0}' expose l'application sur toutes les interfaces réseau, augmentant ainsi le risque d'accès non autorisé.
it: Associare '{0}' espone l'applicazione su tutte le interfacce di rete, aumentando il rischio di accesso non autorizzato.
ja: '{0}' へのバインドは、アプリケーションをすべてのネットワークインターフェイスに公開し、不正アクセスのリスクを高めます。
ko: '{0}'에 바인딩하면 애플리케이션이 모든 네트워크 인터페이스에 노출되어 무단 액세스 위험이 증가합니다.
pt_br: Vincular a '{0}' expõe a aplicação em todas as interfaces de rede, aumentando o risco de acesso não autorizado.
ru: Привязка к '{0}' делает приложение доступным на всех сетевых интерфейсах, увеличивая риск несанкционированного доступа.
zh_cn: 绑定到 '{0}' 会使应用程序暴露在所有网络接口上，从而增加未经授权访问的风险。
zh_tw: 綁定到 '{0}' 會使應用程式暴露在所有網路介面上，增加未經授權存取的風險。

source: Use the localhost address to restrict binding.
de: Verwenden Sie die Localhost-Adresse, um das Binden einzuschränken.
es: Utilice la dirección localhost para restringir la vinculación.
fr: Utilisez l'adresse localhost pour restreindre l'association.
it: Utilizzare l'indirizzo localhost per limitare l'associazione.
ja: ローカルホストアドレスを使用してバインドを制限してください。
ko: 바인딩을 제한하려면 localhost 주소를 사용하세요.
pt_br: Use o endereço localhost para restringir a vinculação.
ru: Используйте адрес localhost, чтобы ограничить привязку.
zh_cn: 请使用本地主机地址来限制绑定。
zh_tw: 請使用本機地址來限制綁定。

source: Comparing digests with the '{0}' operator is vulnerable to timing attacks.
de: Der Vergleich von Digests mit dem Operator '{0}' ist anfällig für Timing-Angriffe.
es: Comparar los resúmenes con el operador '{0}' es vulnerable a ataques de tiempo.
fr: La comparaison de hachages avec l'opérateur '{0}' est vulnérable aux attaques temporelles.
it: Confrontare i digest con l'operatore '{0}' è vulnerabile agli attacchi temporali.
ja: '{0}' 演算子を使用したダイジェスト比較は、タイミング攻撃に対して脆弱です。
ko: '{0}' 연산자로 다이제스트를 비교하면 타이밍 공격에 취약할 수 있습니다.
pt_br: Comparar digests com o operador '{0}' é vulnerável a ataques de temporização.
ru: Сравнение дайджестов с помощью оператора '{0}' уязвимо для атак по времени выполнения.
zh_cn: 使用 '{0}' 运算符比较摘要容易受到时间攻击。
zh_tw: 使用 '{0}' 運算符比較摘要容易受到計時攻擊的影響。

source: Use the 'hmac.compare_digest' function instead of the '==' operator to reduce the vulnerability to timing attacks.
de: Verwenden Sie die Funktion 'hmac.compare_digest' anstelle des '=='-Operators, um die Anfälligkeit für Timing-Angriffe zu verringern.
es: Utilice la función 'hmac.compare_digest' en lugar del operador '==' para reducir la vulnerabilidad a ataques de tiempo.
fr: Utilisez la fonction 'hmac.compare_digest' au lieu de l'opérateur '==' pour réduire la vulnérabilité aux attaques temporelles.
it: Utilizzare la funzione 'hmac.compare_digest' invece dell'operatore '==' per ridurre la vulnerabilità agli attacchi temporali.
ja: '==' 演算子の代わりに 'hmac.compare_digest' 関数を使用し、タイミング攻撃の脆弱性を軽減してください。
ko: '==' 연산자 대신 'hmac.compare_digest' 함수를 사용하여 타이밍 공격 취약성을 줄이세요.
pt_br: Use a função 'hmac.compare_digest' em vez do operador '==' para reduzir a vulnerabilidade a ataques de temporização.
ru: Используйте функцию 'hmac.compare_digest' вместо оператора '==', чтобы уменьшить уязвимость к атакам по времени выполнения.
zh_cn: 请使用 'hmac.compare_digest' 函数替代 '==' 运算符，以降低时间攻击的风险。
zh_tw: 請使用 'hmac.compare_digest' 函式替代 '==' 運算符，以降低計時攻擊的風險。

source: The '{0}' function does not properly validate certificates.
de: Die Funktion '{0}' validiert Zertifikate nicht ordnungsgemäß.
es: La función '{0}' no valida correctamente los certificados.
fr: La fonction '{0}' ne valide pas correctement les certificats.
it: La funzione '{0}' non convalida correttamente i certificati.
ko: '{0}' 함수는 인증서를 올바르게 검증하지 않습니다.
pt_br: A função '{0}' não valida corretamente os certificados.
ru: Функция '{0}' не выполняет корректную проверку сертификатов.
zh_cn: '{0}' 函数未正确验证证书。
zh_tw: '{0}' 函式未正確驗證憑證。
