Repository: securesauce/precli
Catalog: precli/locale/*/LC_MESSAGES/messages.po
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_cn, zh_tw

source: Use 'create_default_context' to safely validate certificates.
de: Verwenden Sie 'create_default_context', um Zertifikate sicher zu validieren.
es: Utilice 'create_default_context' para validar certificados de manera segura.
fr: Utilisez 'create_default_context' pour valider les certificats en toute sécurité.
it: Utilizzare 'create_default_context' per convalidare in modo sicuro i certificati.
ko: 'create_default_context'를 사용하여 안전하게 인증서를 검증하세요.
pt_br: Use 'create_default_context' para validar certificados com segurança.
ru: Используйте 'create_default_context' для безопасной проверки сертификатов.
zh_cn: 请使用 'create_default_context' 来安全验证证书。
zh_tw: 請使用 'create_default_context' 來安全驗證憑證。

source: Using '{0}' with unset 'verify' vulnerable to code injection.
de: Die Verwendung von '{0}' mit nicht gesetztem 'verify' kann zu Code-Injection führen.

source: The FTP protocol can transmit data in cleartext without encryption.
de: Das FTP-Protokoll kann Daten unverschlüsselt im Klartext übertragen.

source: Use the 'FTP_TLS' module to secure the connection.
de: Verwenden Sie das Modul 'FTP_TLS', um die Verbindung zu sichern.

source: Secrets in URLs are vulnerable to unauthorized access.
de: Geheime Daten in URLs sind anfällig für unbefugten Zugriff.
es: Los secretos en las URL son vulnerables al acceso no autorizado.
fr: Les secrets dans les URL sont vulnérables à un accès non autorisé.
it: I segreti negli URL sono vulnerabili ad accessi non autorizzati.
ko: URL에 포함된 비밀 정보는 무단 액세스에 취약합니다.
pt_br: Segredos em URLs são vulneráveis a acessos não autorizados.
ru: Секретные данные в URL-адресах уязвимы для несанкционированного доступа.
zh_cn: URL 中的敏感信息容易被未经授权访问。
zh_tw: URL 中的敏感資訊容易被未經授權存取。

source: Set the 'Secure' flag to True on all cookies.
de: Setzen Sie das 'Secure'-Flag für alle Cookies auf 'True'.
es: Establezca el indicador 'Secure' en True en todas las cookies.
fr: Définissez le drapeau 'Secure' sur True pour tous les cookies.
it: Impostare il flag 'Secure' su True per tutti i cookie.
ko: 모든 쿠키의 'Secure' 플래그를 True로 설정하세요.
pt_br: Defina o atributo 'Secure' como True em todos os cookies.
ru: Установите флаг 'Secure' в True для всех файлов cookie.
zh_cn: 请在所有 cookie 上设置 'Secure' 标志为 True。
zh_tw: 請在所有 cookie 上設置 'Secure' 標誌為 True。

source: The SecureRandom algorithm '{0}' may not provide sufficient entropy.
de: Der SecureRandom-Algorithmus '{0}' bietet möglicherweise nicht genügend Entropie.
es: El algoritmo SecureRandom '{0}' puede no proporcionar suficiente entropía.
fr: L'algorithme SecureRandom '{0}' peut ne pas fournir une entropie suffisante.
it: L'algoritmo SecureRandom '{0}' potrebbe non fornire entropia sufficiente.
ko: SecureRandom 알고리즘 '{0}'이 충분한 엔트로피를 제공하지 않을 수 있습니다.
pt_br: O algoritmo SecureRandom '{0}' pode não fornecer entropia suficiente.
ru: Алгоритм SecureRandom '{0}' может не обеспечивать достаточную энтропию.
zh_cn: SecureRandom 算法 '{0}' 可能无法提供足够的熵值。
zh_tw: SecureRandom 演算法 '{0}' 可能無法提供足夠的熵值。

source: Use SecureRandom without specifying an algorithm, allowing the Java runtime to select the strongest available algorithm.
de: Verwenden Sie SecureRandom ohne Angabe eines Algorithmus, damit die Java-Laufzeitumgebung den stärksten verfügbaren Algorithmus auswählt.
es: Utilice SecureRandom sin especificar un algoritmo, permitiendo que el entorno de ejecución de Java seleccione el algoritmo más fuerte disponible.
fr: Utilisez SecureRandom sans spécifier d'algorithme afin de permettre à l'environnement d'exécution Java de sélectionner l'algorithme le plus robuste disponible.
it: Utilizzare SecureRandom senza specificare un algoritmo, consentendo al runtime Java di selezionare l'algoritmo più forte disponibile.
ko: 알고리즘을 지정하지 않고 SecureRandom을 사용하면 Java 런타임이 가장 강력한 알고리즘을 선택할 수 있습니다.
pt_br: Use SecureRandom sem especificar um algoritmo, permitindo que o runtime Java escolha o mais forte disponível.
ru: Используйте SecureRandom без указания алгоритма, чтобы среда выполнения Java выбрала наиболее надежный доступный алгоритм.
zh_cn: 请在使用 SecureRandom 时不指定算法，以便 Java 运行时选择最强的可用算法。
zh_tw: 請在使用 SecureRandom 時不指定演算法，以讓 Java 執行時選擇最強的可用演算法。
